---
kind: type
id: T:Autodesk.Revit.DB.FailureProcessingResult
source: html/f147e6e6-4b2e-d61c-df9b-8b8e5ebe3fcb.htm
---
# Autodesk.Revit.DB.FailureProcessingResult

An enumerated type representing the result achieved by any of the available types of failure handlers:
 FailuresPreprocessor, the handler of FailuresProcessing event or a FailuresProcessor.

## Syntax (C#)
```csharp
public enum FailureProcessingResult
```

## Remarks
The ability to return certain values may be restricted for certain methods or for certain contexts.